# St7GetNumSeismicCase

Returns the number of primary load cases in a Strand7 model that are of Seismic type.

Strand7 API Manual

long St7GetNumSeismicCase(long uID, long* NumCases)

Input Parameters

uID

Strand7 model file ID.

Output Parameters
NumCases

The number of cases.